{
  "education": [
    {
      "awards_achievements": [
        "Graduated with First Class Standing"
      ],
      "degree": "Bachelor of Science",
      "department": "Computer Science",
      "duration": "2020-2022",
      "school_name": "York University"
    },
    {
      "awards_achievements": [
        "Dean's Honour Roll (2017)"
      ],
      "degree": "Bachelor of Science",
      "department": "Kinesiology and Health Science",
      "duration": "2013-2018",
      "school_name": "York University"
    }
  ],
  "github_repo_root_url": "https://github.com/raymond-van",
  "highlighted_projects": [
    {
      "description": "Reproduced modern machine learning research (PlaNet, Hafner et al.) using PyTorch. PlaNet is a model-based reinforcement learning agent that learns a world model and uses it to maximize its objective by planning in latent space. Achieved comparable performance to the original authors on select control tasks. Wrote a paper and presented my results.",
      "git_url": "https://github.com/raymond-van/planet",
      "name": "Machine Learning Research Reproducibility Challenge (Python)"
    },
    {
      "description": "Created a trading bot that finds arbitrage opportunities on decentralized exchanges and automatically executes trades if a profit can be made. Utilized low-level OS concepts (multithreading) to improve performance, graph algorithms (DFS) to quickly find profitable trading paths and applied calculus to determine the optimal input amount that would maximize profit. Wrote smart contracts to execute trades on the Ethereum blockchain.",
      "git_url": null,
      "name": "Cryptocurrency Trading Bot (GoLang)"
    },
    {
      "description": "Developed an NBA predictions model using traditional machine learning algorithms (SciPy) along with a companion site (Express, MongoDB) that would update daily with new predictions. Built a Twitter clone (Django), as well as a Pomodoro app (React).",
      "git_url": "https://github.com/raymond-van",
      "name": "Miscellaneous projects"
    }
  ],
  "jarvis_projects": [
    {
      "description": "On a CentOS VM, I provisioned a Postgresql database using docker in order to store hardware spec and usage data for linux nodes in a cluster. I wrote bash scripts in order collect, process and insert this data into the provisioned postgresql database. These bash scripts was automated to run every minute with crontab. Reports for future resource planning could then be written based off of the collected data.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": [
        "JDBC App: Todo",
        "Grep App: Todo"
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Raymond Van",
  "others": [
    {
      "bullets": [
        "Running"
      ],
      "title": "Miscellaneous"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting Group",
      "description": "Built various Java projects using technologies like Spring and Docker.",
      "duration": "Sep 2022 - present",
      "title": "Software Developer"
    },
    {
      "company": "Viral Nation",
      "description": "Created, fixed and migrated a variety of REST/GraphQL APIs and integrated them into a React/Redux frontend. Developed the notifications feature using AWS SNS, SQS and websockets. Implemented cookie-based authentication with JWT tokens to improve security and persist user sessions.",
      "duration": "Jun 2022 - Aug 2022",
      "title": "Software Engineer"
    },
    {
      "company": "APTLY Lab @ York University",
      "description": "Investigated how different hyperparameters (batch-size, # of layers) effected the accuracy and performance of a deep neural network.",
      "duration": "Sep 2017 - Dec 2017",
      "title": "Research Volunteer"
    }
  ],
  "skills": {
    "competent": [
      "PyTorch",
      "Express",
      "React",
      "RDBMS/SQL",
      "Apollo GraphQL"
    ],
    "familiar": [
      "C",
      "GoLang",
      "Solidity",
      "Django",
      "AWS"
    ],
    "proficient": [
      "Java",
      "C++",
      "Python",
      "JavaScript",
      "Machine Learning"
    ]
  },
  "summary": "(WIP) I am a computer science graduate from York University. During my time at York, I .... . Most recently, I worked as a Software Engineer at Viral Nation where I learned a lot about full stack web development. I'm passionate about difficult technical challenges and acquiring the skills to solve them.  ..."
}
